<?php
// <!-- سوف نستعرض اشهر الدوال التي تستخدم في التاريخ والوقت -->

// <!-- date توقم هذه الداله بعرض التاريخ او الوقت وهذا على حسب التنسيق -->

// <!-- مثلاً لعرض الوقت -->
echo "الوقت الحالي هو : ".date("H:i:s")."<pre>";
// هنا لعرض التاريخ
echo "التاريخ الحالي هو : ".date("Y-m-d")."<pre>";

// timestime تستخدم لعرض الوقت الحالي

echo "الوقت الحالي هو : ".time()."<pre>";

// تحول نص تاريخ إلى Timestamp.

echo "نص التاريخ المحول هو : ".strtotime("2025-12-18")."<pre>";


//  date_default_timezone_set()  تحديد المنطقة الزمنية.


echo "المنطقه الزمنيه المحدده هي  : ".date_default_timezone_set("Asia/Aden");


//  getdate()   تعيد معلومات كاملة عن التاريخ.

print_r(getdate());

?>